
import { CookiesTranslations } from '../../types';

export const cookies: CookiesTranslations = {
  bannerTitle: 'Повідомлення про файли cookie',
  bannerText: 'Ми використовуємо файли cookie для покращення вашого досвіду перегляду, показу персоналізованої реклами або контенту та аналізу нашого трафіку. Натискаючи "Прийняти все", ви погоджуєтеся на використання наших файлів cookie.',
  customize: 'Налаштувати',
  acceptAll: 'Прийняти все',
  settingsTitle: 'Налаштування файлів cookie',
  settingsDescription: 'Керуйте своїми налаштуваннями файлів cookie. Необхідні файли cookie завжди ввімкнені, оскільки вони є важливими для правильної роботи веб-сайту.',
  necessaryTitle: 'Необхідні',
  required: 'Обов\'язкові',
  necessaryDescription: 'Ці файли cookie необхідні для правильної роботи веб-сайту і не можуть бути вимкнені.',
  functionalTitle: 'Функціональні',
  functionalDescription: 'Ці файли cookie дозволяють веб-сайту забезпечувати розширену функціональність та персоналізацію.',
  analyticsTitle: 'Аналітичні',
  analyticsDescription: 'Ці файли cookie допомагають нам зрозуміти, як відвідувачі взаємодіють з веб-сайтом, допомагаючи нам покращувати наші послуги.',
  marketingTitle: 'Маркетингові',
  marketingDescription: 'Ці файли cookie використовуються для відстеження відвідувачів на веб-сайтах для відображення релевантної реклами.',
  cancel: 'Скасувати',
  savePreferences: 'Зберегти налаштування',
};
